# -*- coding: utf-8 -*-
"""
Created on Mon Feb 22 12:47:40 2016

@author: user
"""
level1=520000*0.05
level2=(1170000-520000)*0.12
level3=(2350000-1170000)*0.2
level4=(4400000-2350000)*0.3
level5=(10000000-4400000)*0.4
income=int(input('請輸入淨年所得額: '))
if income<=520000: #條件1
    tax=income*0.05
elif income<=1170000: #條件2
    tax=level1+((income-520000)*0.12)
elif income<= 2350000: #條件3
    tax=level1+level2+((income-1170000)*0.2)
elif income<=4400000: #條件4
    tax=level1+level2+level3+((income-2350000)*0.3)
elif income<=10000000: #條件5
    tax=level1+level2+level3+level4+((income-4400000)*0.4)
else: #條件6
    tax=level1+level2+level3+level4+level5+((income-10000000)*0.45)    
print('應繳稅額 = ', tax)


#0-520,000 	5% 
#520,001-1,170,000 	12% 
#1,170,001-2,350,000 	20% 
#2,2,350,001-4,400,000 	30% 
#4,400,001-10,000,000 	40% 
#10,000,000萬以上 	45% 


#level1=520000*0.05
#level2=
#income=int(input('請輸入淨年所稅額: '))
#if income<=520000:
#    tax=income*0.05
#elif income<=1170000:
#
#    tax=level1+((income-520000)*0.12)
#elif income<= 2350000:
#    level
#    tax=level1+((1170000-520000)*0.12)+((income-1170000)*0.2)
#elif income<=4400000:
#    tax=(520000*0.05)+((1170000-520000)*0.12)+((2350000-1170000)*0.2)+((income-2350000)*0.3)
#elif income<=10000000:
#    tax=(520000*0.05)+((1170000-520000)*0.12)+((2350000-1170000)*0.2)+((4400000-2350000)*0.3)+((income-4400000)*0.4)
#else:
#    tax=(520000*0.05)+((1170000-520000)*0.12)+((2350000-1170000)*0.2)+((4400000-2350000)*0.3)+((10000000-4400000)*0.4)+((income-10000000)*0.45)    
#print('應繳稅額 = ')
